#### load SQL extension

In [2]:
%reload_ext sql

#### connect to world db

In [4]:
import os
from dotenv import load_dotenv
load_dotenv()

DB_NAME = os.getenv("DB_NAME")

DB_USER = os.getenv("DB_USER")
DB_PASSWORD = os.getenv("DB_PASSWORD")
DB_HOST = os.getenv("DB_HOST")
DB_PORT = os.getenv("DB_PORT")

connection_string = f"mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"

%sql $connection_string

'Connected: root@world'

### show tables in world database

In [15]:
%sql SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/world
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

####List all cities in Kenya

In [16]:
%%sql
SELECT
    Name,
    District,
    Population
FROM
    city
WHERE
    CountryCode = "KEN";

 * mysql+pymysql://root:***@localhost:3306/world
8 rows affected.

[('Nairobi', 'Nairobi', 2290000),
 ('Mombasa', 'Coast', 461753),
 ('Kisumu', 'Nyanza', 192733),
 ('Nakuru', 'Rift Valley', 163927),
 ('Machakos', 'Eastern', 116293),
 ('Eldoret', 'Rift Valley', 111882),
 ('Meru', 'Eastern', 94947),
 ('Nyeri', 'Central', 91258)]

#### Number of countries per continent

In [5]:
%%sql
SELECT 
	Continent,
    COUNT(*) AS NumberOfCountries
FROM
	country
GROUP BY 
	Continent
ORDER BY
	NumberOfCountries;

 * mysql+pymysql://root:***@localhost:3306/world
7 rows affected.

[('Antarctica', 5),
 ('South America', 14),
 ('Oceania', 28),
 ('North America', 37),
 ('Europe', 46),
 ('Asia', 51),
 ('Africa', 58)]

#### Top 10 populated cities in the world

In [6]:
%%sql
SELECT
    Name,
    CountryCode,
    Population
FROM
    city
ORDER BY 
    Population DESC
LIMIT
    10;

 * mysql+pymysql://root:***@localhost:3306/world
10 rows affected.

[('Mumbai (Bombay)', 'IND', 10500000),
 ('Seoul', 'KOR', 9981619),
 ('São Paulo', 'BRA', 9968485),
 ('Shanghai', 'CHN', 9696300),
 ('Jakarta', 'IDN', 9604900),
 ('Karachi', 'PAK', 9269265),
 ('Istanbul', 'TUR', 8787958),
 ('Ciudad de México', 'MEX', 8591309),
 ('Moscow', 'RUS', 8389200),
 ('New York', 'USA', 8008278)]

statistical summary of world data

In [8]:
%%sql
SELECT
    Region,
    COUNT(*) AS total_countries,
    MAX(NULLIF(Population,0)) AS max_population,
    MIN(NULLIF(Population,0)) AS min_population,
    AVG(NULLIF(Population,0)) AS avg_population,
    SUM(NULLIF(Population,0)) AS total_population,
    MAX(NULLIF(LifeExpectancy,0)) AS max_life_expectancy,
    MIN(NULLIF(LifeExpectancy,0)) AS min_life_expectancy,
    AVG(NULLIF(LifeExpectancy,0)) AS avg_life_expectancy,
    MAX(NULLIF(SurfaceArea,0)) AS max_surface_area,
    MIN(NULLIF(SurfaceArea,0)) AS min_surface_area,
    AVG(NULLIF(SurfaceArea,0)) AS avg_surface_area
FROM
    country

GROUP BY
    Region
ORDER BY
    Region;

 * mysql+pymysql://root:***@localhost:3306/world
25 rows affected.

[('Antarctica', 5, None, None, None, None, None, None, None, Decimal('13120000.00'), Decimal('59.00'), Decimal('2626420.200000')),
 ('Australia and New Zealand', 5, 18886000, 600, Decimal('4550620.0000'), Decimal('22753100'), Decimal('79.8'), Decimal('77.8'), Decimal('78.80000'), Decimal('7741220.00'), Decimal('14.00'), Decimal('1602387.800000')),
 ('Baltic Countries', 3, 3698500, 1439200, Decimal('2520633.3333'), Decimal('7561900'), Decimal('69.5'), Decimal('68.4'), Decimal('69.00000'), Decimal('65301.00'), Decimal('45227.00'), Decimal('58372.333333')),
 ('British Islands', 2, 59623400, 3775100, Decimal('31699250.0000'), Decimal('63398500'), Decimal('77.7'), Decimal('76.8'), Decimal('77.25000'), Decimal('242900.00'), Decimal('70273.00'), Decimal('156586.500000')),
 ('Caribbean', 24, 11201000, 8000, Decimal('1589166.6667'), Decimal('38140000'), Decimal('78.9'), Decimal('49.2'), Decimal('73.05833'), Decimal('110861.00'), Decimal('96.00'), Decimal('9767.625000')),
 ('Central Africa', 9, 51654000, 147000, Decimal('10628000.0000'), Decimal('95652000'), Decimal('65.3'), Decimal('38.3'), Decimal('50.31111'), Decimal('2344858.00'), Decimal('964.00'), Decimal('734740.777778')),
 ('Central America', 8, 98881000, 241000, Decimal('16902625.0000'), Decimal('135221000'), Decimal('75.8'), Decimal('66.2'), Decimal('71.02500'), Decimal('1958201.00'), Decimal('21041.00'), Decimal('309941.500000')),
 ('Eastern Africa', 20, 62565000, 77000, Decimal('12999947.3684'), Decimal('246999000'), Decimal('72.7'), Decimal('37.2'), Decimal('50.81053'), Decimal('1104300.00'), Decimal('78.00'), Decimal('314994.550000')),
 ('Eastern Asia', 8, 1277558000, 473000, Decimal('188416000.0000'), Decimal('1507328000'), Decimal('81.6'), Decimal('67.3'), Decimal('75.25000'), Decimal('9572900.00'), Decimal('18.00'), Decimal('1471810.250000')),
 ('Eastern Europe', 10, 146934000, 4380000, Decimal('30702600.0000'), Decimal('307026000'), Decimal('74.5'), Decimal('64.5'), Decimal('69.93000'), Decimal('17075400.00'), Decimal('33851.00'), Decimal('1881409.400000')),
 ('Melanesia', 5, 4807000, 190000, Decimal('1294400.0000'), Decimal('6472000'), Decimal('72.8'), Decimal('60.6'), Decimal('67.14000'), Decimal('462840.00'), Decimal('12189.00'), Decimal('108154.800000')),
 ('Micronesia', 7, 168000, 12000, Decimal('77571.4286'), Decimal('543000'), Decimal('77.8'), Decimal('59.8'), Decimal('68.08571'), Decimal('726.00'), Decimal('21.00'), Decimal('443.142857')),
 ('Micronesia/Caribbean', 1, None, None, None, None, None, None, None, Decimal('16.00'), Decimal('16.00'), Decimal('16.000000')),
 ('Middle East', 18, 66591000, 599000, Decimal('10465594.4444'), Decimal('188380700'), Decimal('78.6'), Decimal('59.8'), Decimal('70.56667'), Decimal('2149690.00'), Decimal('694.00'), Decimal('267810.666667')),
 ('Nordic Countries', 7, 8861400, 3200, Decimal('3452342.8571'), Decimal('24166400'), Decimal('79.6'), Decimal('76.5'), Decimal('78.33333'), Decimal('449964.00'), Decimal('1399.00'), Decimal('188843.000000')),
 ('North America', 5, 278357000, 7000, Decimal('61926400.0000'), Decimal('309632000'), Decimal('79.4'), Decimal('68.1'), Decimal('75.82000'), Decimal('9970610.00'), Decimal('53.00'), Decimal('4300103.000000')),
 ('Northern Africa', 7, 68470000, 293000, Decimal('24752285.7143'), Decimal('173266000'), Decimal('75.5'), Decimal('49.8'), Decimal('65.38571'), Decimal('2505813.00'), Decimal('163610.00'), Decimal('1217814.714286')),
 ('Polynesia', 10, 235000, 50, Decimal('63305.0000'), Decimal('633050'), Decimal('75.1'), Decimal('66.3'), Decimal('70.73333'), Decimal('4000.00'), Decimal('12.00'), Decimal('846.300000')),
 ('South America', 14, 170115000, 2000, Decimal('24698571.4286'), Decimal('345780000'), Decimal('76.1'), Decimal('62.9'), Decimal('70.94615'), Decimal('8547403.00'), Decimal('12173.00'), Decimal('1276066.142857')),
 ('Southeast Asia', 11, 212107000, 328000, Decimal('47140090.9091'), Decimal('518541000'), Decimal('80.1'), Decimal('46.0'), Decimal('64.40000'), Decimal('1904569.00'), Decimal('618.00'), Decimal('408618.272727')),
 ('Southern Africa', 5, 40377000, 1008000, Decimal('9377200.0000'), Decimal('46886000'), Decimal('51.1'), Decimal('39.3'), Decimal('44.82000'), Decimal('1221037.00'), Decimal('17364.00'), Decimal('534955.600000')),
 ('Southern and Central Asia', 14, 1013662000, 286000, Decimal('106484000.0000'), Decimal('1490776000'), Decimal('71.8'), Decimal('45.9'), Decimal('61.35000'), Decimal('3287263.00'), Decimal('298.00'), Decimal('770795.000000')),
 ('Southern Europe', 15, 57680000, 1000, Decimal('9644946.6667'), Decimal('144674200'), Decimal('83.5'), Decimal('71.5'), Decimal('76.52857'), Decimal('505992.00'), Decimal('0.40'), Decimal('87759.493333')),
 ('Western Africa', 17, 111506000, 6000, Decimal('13039529.4118'), Decimal('221672000'), Decimal('76.8'), Decimal('41.3'), Decimal('52.74118'), Decimal('1267000.00'), Decimal('314.00'), Decimal('361078.705882')),
 ('Western Europe', 9, 82164700, 32300, Decimal('20360844.4444'), Decimal('183247600'), Decimal('79.6'), Decimal('77.1'), Decimal('78.25556'), Decimal('551500.00'), Decimal('1.50'), Decimal('123161.833333'))]